In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
depth = pd.read_csv('./Data/Jasechko_et_al_2024_GroundwaterLevelData/AnnualDepthToGroundwater.csv')
elev = pd.read_csv('./Data/Jasechko_et_al_2024_GroundwaterLevelData/AnnualGroundwaterElevation.csv')

In [19]:
depth.head(), elev.head()

(      StnID        Lat       Lon  IntegerYear  DepthToWater_m
 0  30000000 -12.741100 -60.13250         2011          22.250
 1  30000001  -0.620556 -47.35861         2015          33.770
 2  30000001  -0.620556 -47.35861         2016          32.285
 3  30000001  -0.620556 -47.35861         2017          31.780
 4  30000001  -0.620556 -47.35861         2018          30.020,
        StnID      Lat       Lon  IntegerYear  GroundwaterElevation_masl
 0  150000002  50.2672  11.23317         1993                     312.16
 1  150000002  50.2672  11.23317         1994                     312.67
 2  150000002  50.2672  11.23317         1995                     313.00
 3  150000002  50.2672  11.23317         1996                     312.66
 4  150000002  50.2672  11.23317         1997                     312.68)

In [22]:
depth['StnID'].nunique(), elev['StnID'].nunique()

(901543, 16684)

In [24]:
depth['StnID'].value_counts(), elev['StnID'].value_counts()

(StnID
 1000289129    110
 330005617     108
 330005613     105
 330005388     101
 1000671479    100
              ...
 1000322669      1
 1000322670      1
 1000322673      1
 1000322674      1
 1000445182      1
 Name: count, Length: 901543, dtype: int64,
 StnID
 330005617     108
 330005613     105
 330005388     101
 330005395      96
 330005482      73
              ...
 1030017621      1
 1030017637      1
 1030017795      1
 1030017923      1
 1040135698      1
 Name: count, Length: 16684, dtype: int64)

In [6]:
elev.describe()

,StnID,Lat,Lon,IntegerYear,GroundwaterElevation_masl
count,1.908790e+05,190879.000000,190879.000000,190879.000000,190879.000000
mean,3.684465e+08,48.327363,-15.194287,1999.535585,160.644095
std,2.676845e+08,9.160447,46.963516,15.436590,165.028564
min,4.000056e+07,-21.344400,-124.261200,1900.000000,-557.230000
25%,2.400004e+08,45.217400,-1.090898,1989.000000,27.850000
50%,3.300023e+08,49.139500,3.064875,2003.000000,121.235000
75%,3.300054e+08,50.457900,11.294600,2012.000000,239.837500
max,1.040136e+09,68.355400,119.416700,2022.000000,2629.471800

In [11]:
depth.shape

(4170802, 5)

In [13]:
depth['StnID'].value_counts()

StnID
1000289129    110
330005617     108
330005613     105
330005388     101
1000671479    100
             ...
1000322669      1
1000322670      1
1000322673      1
1000322674      1
1000445182      1
Name: count, Length: 901543, dtype: int64

In [14]:
elev['StnID'].value_counts()

StnID
330005617     108
330005613     105
330005388     101
330005395      96
330005482      73
             ...
1030017621      1
1030017637      1
1030017795      1
1030017923      1
1040135698      1
Name: count, Length: 16684, dtype: int64

In [10]:
elev.shape

(190879, 5)

In [15]:
#drop all stations that didn't get a depth
merge_depth = pd.merge(depth, elev, how='left', on='StnID')

In [17]:
#drop all stations that didn't get elevation
merge_elev = pd.merge(elev, depth, how='left', on='StnID')

In [18]:
print(depth.shape)
print(elev.shape)
print(merge_depth.shape)
print(merge_elev.shape)

(4170802, 5)
(190879, 5)
(7610983, 9)
(3664131, 9)

**An "inner" join will drop all rows that don't have a match on the other side**
- in this case, we'd be dropping all ratings that don't have a movieId
- it's possible a rating on th eleft didn't get a title by accident and we don't wnat to drop that
- It will also drop all movies that were never rated
- this will shirnk your data set


**A "left" join will drop all movies that didn't get a rating**
- this is ok becasue we're looking at ratings today
- We are doing this join because we want to keep all the ratings no matter what


**An "outer" join is we're keeping everything no matter what**
- this would keep every rating regardless if it has a movie attached
- we would also be keeping every movie regardless if we had a rating for it, which since we're looking at ratings, there is no point to *Outer joins will blow up your dataset

In [31]:
merge_depth.sample(10)

,StnID,Lat_x,Lon_x,IntegerYear_x,DepthToWater_m,Lat_y,Lon_y,IntegerYear_y,GroundwaterElevation_masl
5069947,1000444951,34.0999,-117.330200,2006,63.63767,NaN,NaN,NaN,NaN
2058909,330003344,47.8995,1.573554,2000,15.09000,47.8995,1.573554,2009.0,112.640
3683341,1000010952,40.9682,-72.676360,2009,24.03958,NaN,NaN,NaN,NaN
4776706,1000380924,32.6246,-89.140620,1967,9.14400,NaN,NaN,NaN,NaN
1524772,330001761,45.0232,-0.590917,2004,1.16000,45.0232,-0.590917,2000.0,2.910
2435192,330003871,48.4552,1.897412,1991,22.94000,48.4552,1.897412,1979.0,132.800
5078944,1000446667,34.1447,-117.266200,1943,29.47416,NaN,NaN,NaN,NaN
6013775,1000661143,40.1450,-100.418500,1978,47.24400,NaN,NaN,NaN,NaN
1789118,330002648,46.9261,2.217846,2003,22.76000,46.9261,2.217846,2008.0,143.165
4670831,1000354590,32.0256,-110.960900,1969,28.54452,NaN,NaN,NaN,NaN

In [34]:
# merge_depth.IntegerYear_y.astype('int64')
# merge_depth.dtypes

In [39]:
merge_inner = pd.merge(depth, elev, how='inner', on=['StnID', 'IntegerYear'])

In [41]:
merge_inner.sample(10)

,StnID,Lat_x,Lon_x,IntegerYear,DepthToWater_m,Lat_y,Lon_y,GroundwaterElevation_masl
178,170000069,50.7102,5.883652,2014,35.010000,50.7102,5.883652,250.360000
26089,330000034,42.4421,9.519890,1996,3.780000,42.4421,9.519890,1.220000
41768,330001262,44.5847,-0.256177,1963,12.640000,44.5847,-0.256177,20.800000
41229,330001224,44.5296,-0.654254,1999,15.280000,44.5296,-0.654254,53.250000
101855,330005330,50.2779,2.296501,1982,2.800000,50.2779,2.296501,68.740000
36229,330000849,43.8777,4.514095,2016,2.865000,43.8777,4.514095,63.935000
46532,330001512,44.7522,-1.190325,2000,0.190000,44.7522,-1.190325,8.650000
60139,330002427,46.2450,-0.692400,1999,3.965000,46.2450,-0.692400,3.935000
121636,1030066250,37.7377,-122.197500,2009,1.499616,37.7377,-122.197500,2.673096
102855,330005384,50.3506,3.068658,1954,3.775000,50.3506,3.068658,22.395000

In [42]:
print(depth.shape)
print(elev.shape)
print(merge_depth.shape)
print(merge_elev.shape)
print(merge_inner.shape)

(4170802, 5)
(190879, 5)
(7610983, 9)
(3664131, 9)
(122187, 8)

In [43]:
merge_inner.drop(columns=['Lat_y', 'Lon_y'], inplace=True)

In [44]:
merge_inner.head()

,StnID,Lat_x,Lon_x,IntegerYear,DepthToWater_m,GroundwaterElevation_masl
0,170000051,50.4975,4.457745,2011,3.920,127.350
1,170000051,50.4975,4.457745,2012,4.040,127.230
2,170000051,50.4975,4.457745,2013,3.800,127.470
3,170000051,50.4975,4.457745,2014,3.720,127.550
4,170000051,50.4975,4.457745,2015,3.275,127.995

In [ ]:
merge_inner.to_csv('./Team2/Da'data')